export const react_courses = [
    {
        id:'react_1',
        name:'مبانی HTML و HTML5',
        description:'HTML  زبان نشانه گذاری است که ساختار صفحه پیچ را تشکیل میدهد. HTML  معمولا بر دور محتوای پیچ با قرار دادن نشانک به محتوی پیچ معنا و ساختار میدهد. برای مثال نشانک ها میتوانند یک تکه نوشته را به عناصر متفاوتی همچون تیتر، پاراگراف،لینک و یا لیست تبدیل کنند.در این بخش به مهمترین عناصر و مفاهیم HTML میپردازیم.',
    },
    {
        id:'react_2',
        name:'مبانی CSS',
        description:'CSS به مرورگر میگوید که محتوای پیجی که با HTML نوشتید را چگونه نمایش دهد. با CSS میتوانید رنگ، فونت، اندازه و بسیاری از دیگر جنبه های یک ساختمان HTML را کنترل کنید. حال که ساختمان سایتتان را درست کرده اید وقت آن است که با CSS به تزیین آن بپردازیم.',
    },
    {
        id:'react_3',
        name:'قوانین طراحی سایت کنشگرا',
        description: ".طراحی سایت واکنشگرا درباره ساخت وب سایتی است که، در تمام موبایل ها،تبلت ها، لپ تاپ ها یا دسکتاپ ها به وضوع و مرتب و زیبا دیده شود در این بخش به کمک  CSS سایتتان را طوری طراحی خواهید کرد که در همه حال عالی باشد. مهم نیست که رو چه دستگاهی نمایش داده میشوند..",
    },
    {
        id:'react_4',
        name:'جاوا اسکریپت مقدماتی',
        description: "جاوا اسکریپت زبان برنامه‌نویسی پویا و مبتنی بر شی (Object-based) است که هم سمت کاربر و هم سمت سرور، برای ایجاد تعمال با صفحات وب به کار می‌رود .در این بخش به مبانی پایه زبان برنامه نویسی جاوااسکریپت میپردازیم.",
    },
    {
        id:'react_5',
        name:'جاوا اسکریپت در توسعه وب',
        description: "در این بخش به تعاملی کردن سایت بوسیله جاوااسکریپت و نحوه ی نوشتن عملکرد وب میپردازیم.",
    },
    {
        id:'react_6',
        name:'آموزش ری اکت',
        description: "ری اکت (reactjs) اساسا یک کتابخونه open-source جاوا اسکریپتی برای ساخت رابط کاربری(user interfaces) برای single page applications(اپلیکیشن های تک صفحه ای) است.این کتابخونه برای مدیریت لایه View برای وب استفاده می شود.در این قسمت به چگونگی ایجاد یک پروژه ری اکت و نوشتن یک سایت تک صفحه به صورت پروژه محور میپردازیم.",
    },
]
const categories = [
    {
        id: 1,
        cat: 'mongoDB',
        img:  ' /assets/images/mongologo.jpg',
        color: 'var(--mongo-green)',
    },
    {
        id: 2,
        cat: 'express',
        img:  ' /assets/images/Ex.jpg',
        color: 'var(--express-pink)',
    },    
    {
        id: 3,
        cat: 'reactJS',
        img:  ' /assets/images/react-logo.jpg',
        color: 'var(--react-blue)',
    },    
    {
        id: 4,
        cat: 'nodeJS',
        img:  ' /assets/images/nodelogo.jpg',
        color: 'var(--node-green)',
    },
];
export default categories;
